######### PMs ##########
Model: "PM_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization (BatchNo (None, 32, 32, 3)         12        
_________________________________________________________________
Input_layer (Flatten)        (None, 3072)              0         
_________________________________________________________________
Hidden_layer0 (Dense)        (None, 30)                92190     
_________________________________________________________________
Hidden_layer1 (Dense)        (None, 15)                465       
_________________________________________________________________
Output_layer (Dense)         (None, 10)                160       
=================================================================
Total params: 92,827
Trainable params: 92,821
Non-trainable params: 6
_________________________________________________________________
Model: "PM_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_1 (Batch (None, 32, 32, 3)         12        
_________________________________________________________________
Input_layer (Flatten)        (None, 3072)              0         
_________________________________________________________________
Hidden_layer0 (Dense)        (None, 30)                92190     
_________________________________________________________________
Hidden_layer1 (Dense)        (None, 15)                465       
_________________________________________________________________
Hidden_layer2 (Dense)        (None, 30)                480       
_________________________________________________________________
Output_layer (Dense)         (None, 10)                310       
=================================================================
Total params: 93,457
Trainable params: 93,451
Non-trainable params: 6
_________________________________________________________________
Model: "PM_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_2 (Batch (None, 32, 32, 3)         12        
_________________________________________________________________
Input_layer (Flatten)        (None, 3072)              0         
_________________________________________________________________
Hidden_layer0 (Dense)        (None, 60)                184380    
_________________________________________________________________
Hidden_layer1 (Dense)        (None, 30)                1830      
_________________________________________________________________
Hidden_layer2 (Dense)        (None, 15)                465       
_________________________________________________________________
Output_layer (Dense)         (None, 10)                160       
=================================================================
Total params: 186,847
Trainable params: 186,841
Non-trainable params: 6
_________________________________________________________________
Model: "PM_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_3 (Batch (None, 32, 32, 3)         12        
_________________________________________________________________
Input_layer (Flatten)        (None, 3072)              0         
_________________________________________________________________
Hidden_layer0 (Dense)        (None, 200)               614600    
_________________________________________________________________
Hidden_layer1 (Dense)        (None, 100)               20100     
_________________________________________________________________
Hidden_layer2 (Dense)        (None, 50)                5050      
_________________________________________________________________
Output_layer (Dense)         (None, 10)                510       
=================================================================
Total params: 640,272
Trainable params: 640,266
Non-trainable params: 6
_________________________________________________________________
Model: "PM_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_4 (Batch (None, 32, 32, 3)         12        
_________________________________________________________________
Input_layer (Flatten)        (None, 3072)              0         
_________________________________________________________________
Hidden_layer0 (Dense)        (None, 200)               614600    
_________________________________________________________________
Hidden_layer1 (Dense)        (None, 100)               20100     
_________________________________________________________________
Hidden_layer2 (Dense)        (None, 50)                5050      
_________________________________________________________________
Hidden_layer3 (Dense)        (None, 25)                1275      
_________________________________________________________________
Hidden_layer4 (Dense)        (None, 12)                312       
_________________________________________________________________
Output_layer (Dense)         (None, 10)                130       
=================================================================
Total params: 641,479
Trainable params: 641,473
Non-trainable params: 6
_________________________________________________________________




######### CNNs ##########


Model: "CNN_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_18 (Batc (None, 32, 32, 3)         12        
_________________________________________________________________
conv2d_190 (Conv2D)          (None, 30, 30, 16)        448       
_________________________________________________________________
conv2d_191 (Conv2D)          (None, 28, 28, 16)        2320      
_________________________________________________________________
conv2d_192 (Conv2D)          (None, 26, 26, 16)        2320      
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 13, 13, 16)        0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 2704)              0         
_________________________________________________________________
Fully_connected_layer0 (Dens (None, 60)                162300    
_________________________________________________________________
Fully_connected_layer1 (Dens (None, 30)                1830      
_________________________________________________________________
dense_15 (Dense)             (None, 10)                310       
=================================================================
Total params: 169,540
Trainable params: 169,534
Non-trainable params: 6
_________________________________________________________________


Model: "CNN_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_19 (Batc (None, 32, 32, 3)         12        
_________________________________________________________________
conv2d_193 (Conv2D)          (None, 30, 30, 16)        448       
_________________________________________________________________
conv2d_194 (Conv2D)          (None, 28, 28, 8)         1160      
_________________________________________________________________
conv2d_195 (Conv2D)          (None, 26, 26, 6)         438       
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 13, 13, 6)         0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 1014)              0         
_________________________________________________________________
Fully_connected_layer0 (Dens (None, 128)               129920    
_________________________________________________________________
Fully_connected_layer1 (Dens (None, 64)                8256      
_________________________________________________________________
dense_16 (Dense)             (None, 10)                650       
=================================================================
Total params: 140,884
Trainable params: 140,878
Non-trainable params: 6
_________________________________________________________________


Model: "CNN_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_20 (Batc (None, 32, 32, 3)         12        
_________________________________________________________________
conv2d_196 (Conv2D)          (None, 28, 28, 32)        2432      
_________________________________________________________________
conv2d_197 (Conv2D)          (None, 24, 24, 32)        25632     
_________________________________________________________________
conv2d_198 (Conv2D)          (None, 20, 20, 32)        25632     
_________________________________________________________________
conv2d_199 (Conv2D)          (None, 16, 16, 32)        25632     
_________________________________________________________________
conv2d_200 (Conv2D)          (None, 12, 12, 32)        25632     
_________________________________________________________________
conv2d_201 (Conv2D)          (None, 10, 10, 8)         2312      
_________________________________________________________________
conv2d_202 (Conv2D)          (None, 8, 8, 8)           584       
_________________________________________________________________
conv2d_203 (Conv2D)          (None, 6, 6, 8)           584       
_________________________________________________________________
conv2d_204 (Conv2D)          (None, 4, 4, 8)           584       
_________________________________________________________________
conv2d_205 (Conv2D)          (None, 2, 2, 8)           584       
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 1, 1, 8)           0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 8)                 0         
_________________________________________________________________
Fully_connected_layer0 (Dens (None, 120)               1080      
_________________________________________________________________
Fully_connected_layer1 (Dens (None, 60)                7260      
_________________________________________________________________
dense_17 (Dense)             (None, 10)                610       
=================================================================
Total params: 118,570
Trainable params: 118,564
Non-trainable params: 6
_________________________________________________________________


Model: "CNN_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_21 (Batc (None, 32, 32, 3)         12        
_________________________________________________________________
conv2d_206 (Conv2D)          (None, 30, 30, 4)         112       
_________________________________________________________________
conv2d_207 (Conv2D)          (None, 28, 28, 4)         148       
_________________________________________________________________
conv2d_208 (Conv2D)          (None, 26, 26, 4)         148       
_________________________________________________________________
conv2d_209 (Conv2D)          (None, 24, 24, 4)         148       
_________________________________________________________________
conv2d_210 (Conv2D)          (None, 22, 22, 4)         148       
_________________________________________________________________
conv2d_211 (Conv2D)          (None, 20, 20, 8)         296       
_________________________________________________________________
conv2d_212 (Conv2D)          (None, 18, 18, 8)         584       
_________________________________________________________________
conv2d_213 (Conv2D)          (None, 16, 16, 8)         584       
_________________________________________________________________
conv2d_214 (Conv2D)          (None, 14, 14, 8)         584       
_________________________________________________________________
conv2d_215 (Conv2D)          (None, 12, 12, 8)         584       
_________________________________________________________________
conv2d_216 (Conv2D)          (None, 11, 11, 16)        528       
_________________________________________________________________
conv2d_217 (Conv2D)          (None, 10, 10, 16)        1040      
_________________________________________________________________
conv2d_218 (Conv2D)          (None, 9, 9, 16)          1040      
_________________________________________________________________
conv2d_219 (Conv2D)          (None, 8, 8, 16)          1040      
_________________________________________________________________
conv2d_220 (Conv2D)          (None, 7, 7, 16)          1040      
_________________________________________________________________
flatten_18 (Flatten)         (None, 784)               0         
_________________________________________________________________
Fully_connected_layer0 (Dens (None, 120)               94200     
_________________________________________________________________
Fully_connected_layer1 (Dens (None, 60)                7260      
_________________________________________________________________
dense_18 (Dense)             (None, 10)                610       
=================================================================
Total params: 110,106
Trainable params: 110,100
Non-trainable params: 6
_________________________________________________________________


Model: "CNN_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_22 (Batc (None, 32, 32, 3)         12        
_________________________________________________________________
conv2d_221 (Conv2D)          (None, 31, 31, 8)         104       
_________________________________________________________________
conv2d_222 (Conv2D)          (None, 30, 30, 16)        528       
_________________________________________________________________
conv2d_223 (Conv2D)          (None, 29, 29, 24)        1560      
_________________________________________________________________
conv2d_224 (Conv2D)          (None, 28, 28, 32)        3104      
_________________________________________________________________
conv2d_225 (Conv2D)          (None, 27, 27, 64)        8256      
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 13, 13, 64)        0         
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 6, 6, 64)          0         
_________________________________________________________________
flatten_19 (Flatten)         (None, 2304)              0         
_________________________________________________________________
Fully_connected_layer0 (Dens (None, 90)                207450    
_________________________________________________________________
Fully_connected_layer1 (Dens (None, 60)                5460      
_________________________________________________________________
Fully_connected_layer2 (Dens (None, 30)                1830      
_________________________________________________________________
Fully_connected_layer3 (Dens (None, 15)                465       
_________________________________________________________________
dense_19 (Dense)             (None, 10)                160       
=================================================================
Total params: 228,929
Trainable params: 228,923
Non-trainable params: 6
_________________________________________________________________


######### Compile ##########


model.compile(
      optimizer=tf.keras.optimizers.Adam(learning_rate=1e-3, ),
      loss='sparse_categorical_crossentropy',
      metrics=['sparse_categorical_accuracy'])


######### Fit ##########


model.fit(train_images, train_labels, epochs=n_epochs, validation_freq=1, validation_data=(test_images, test_labels))